src/Documents/Scan_ЗадачаИз1ДБ/Scan_ЗадачаИз1ДБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗадачаИз1ДБ</name>
  <registerRecords>InformationRegister.Scan_ИсторияПоступленийИПродажПродуктов</registerRecords>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.Scan_ВидыСобытий1БД</types>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystemTask</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗадачи1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystemInvoice</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНакладной</name>
    <type>
      <types>CatalogRef.Scan_СтатусыНакладных1ДБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДилерНакладной</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ИсторияПоступленийИПродажПродуктов/Scan_ИсторияПоступленийИПродажПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ИсторияПоступленийИПродажПродуктов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача1БД</name>
    <type>
      <types>DocumentRef.Scan_ЗадачаИз1ДБ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Scan_ЗадачаИз1ДБ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) //rarus bonmak 18.05.2020 14375 ++
	// регистр Scan_ИсторияПоступленийИПродажПродуктов
	Движения.Scan_ИсторияПоступленийИПродажПродуктов.Записывать = Истина;
	Для Каждого ТекСтрокаПродукты Из Продукты Цикл
		Движение = Движения.Scan_ИсторияПоступленийИПродажПродуктов.Добавить();
		Движение.Продукт = ТекСтрокаПродукты.Продукт;
		Движение.Задача1БД = Ссылка;
	КонецЦикла;
КонецПроцедуры //rarus bonmak 18.05.2020 14375 --
